InformationRegisters/СписокИсходящихДокументовМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>СписокИсходящихДокументовМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторСубъектаОбращенияОбщийМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОбработкиДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Загружен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагрузкаНеТребуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУстройства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОрганизации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторСубъектаОбращенияОбщийМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СписокИсходящихДокументовМДЛП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавить сообщение в регистра сведений СписокВходящихДокументовМДЛП.
//
// Параметры:
//  Данные - Структура - данные входящего документа.
//
Процедура ДобавитьОписаниеДокумента(Данные) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НоваяЗапись = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(НоваяЗапись, Данные);
	
	НоваяЗапись.ЗагрузкаНеТребуется = НоваяЗапись.ЗагрузкаНеТребуется Или Не НужноЗагружатьДокумент(НоваяЗапись.ТипДокумента);
	
	НоваяЗапись.Записать();
	
КонецПроцедуры

// Устанавливает признак загрузки документа
//
// Параметры:
//  ИдентификаторДокумента - Строка - идентификатор загруженного документа
//
Процедура ОтметитьДокументЗагружен(ИдентификаторДокумента) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.ИдентификаторДокумента.Установить(ИдентификаторДокумента);
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Отсутствуют данные по идентификатору документа %1 в списке исходящих документов'"), ИдентификаторДокумента);
	КонецЕсли;
	Для Каждого Запись Из Набор Цикл
		Запись.Загружен = Истина;
	КонецЦикла;
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НужноЗагружатьДокумент(ТипДокумента)
	
	ТипыДокументовКЗагрузке = Новый Массив;
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияМДЛП.Производство") Тогда
		ТипыДокументовКЗагрузке.Добавить(10311); // Завершение окончательной упаковки РЭ
	КонецЕсли;
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияМДЛП.РозничныеПродажи") Тогда
		ТипыДокументовКЗагрузке.Добавить(10511); // Розничная продажа ККТ
		ТипыДокументовКЗагрузке.Добавить(10521); // Отпуск по льготным рецептам РВ
		ТипыДокументовКЗагрузке.Добавить(10522); // Отпуск по льготным рецептам ККТ
		ТипыДокументовКЗагрузке.Добавить(10523); // Отпуск по льготным рецептам ККТ с отклонением
	КонецЕсли;
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияМДЛП.Склад") Тогда
		ТипыДокументовКЗагрузке.Добавить(431); // Перемещение между собственными местами деятельности
		ТипыДокументовКЗагрузке.Добавить(470); // Перемещение между собственными местами деятельности в рамках ГЛО
		ТипыДокументовКЗагрузке.Добавить(10531); // Выдача для оказания мед. помощи РВ
		ТипыДокументовКЗагрузке.Добавить(10532); // Выдача для оказания мед. помощи РВ с отклонением
		ТипыДокументовКЗагрузке.Добавить(10552); // Вывод по различным причинам РВ
		ТипыДокументовКЗагрузке.Добавить(552); // Выбытие по прочим причинам
	КонецЕсли;
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияМДЛП.ИмпортЭкспорт") Тогда
		ТипыДокументовКЗагрузке.Добавить(10300); // Эмиссия КМ РЭ
		ТипыДокументовКЗагрузке.Добавить(10319); // Упаковка и маркировка за пределами РФ РЭ
	КонецЕсли;
	
	Возврат ТипыДокументовКЗагрузке.Найти(ТипДокумента) <> Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли
